Improved framework description
